{
  "format": "layers-model",
  "generatedBy": "Keras 2.13.0",
  "convertedBy": "Custom Script",
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "functional",
      "trainable": true,
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer"
          },
          "name": "input_layer",
          "inbound_nodes": []
        },
        {
          "class_name": "Rescaling",
          "config": {
            "name": "rescaling",
            "trainable": true,
            "dtype": "float32",
            "scale": 0.00392156862745098,
            "offset": 0.0
          },
          "name": "rescaling",
          "inbound_nodes": [
            [
              ["input_layer", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d",
          "inbound_nodes": [
            [
              ["rescaling", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d",
          "inbound_nodes": [
            [
              ["conv2d", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_1",
          "inbound_nodes": [
            [
              ["max_pooling2d", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d_1",
          "inbound_nodes": [
            [
              ["conv2d_1", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_2",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_2",
          "inbound_nodes": [
            [
              ["max_pooling2d_1", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_2",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          },
          "name": "max_pooling2d_2",
          "inbound_nodes": [
            [
              ["conv2d_2", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_3",
            "trainable": true,
            "dtype": "float32",
            "filters": 256,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "conv2d_3",
          "inbound_nodes": [
            [
              ["max_pooling2d_2", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "GlobalAveragePooling2D",
          "config": {
            "name": "global_average_pooling2d",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last",
            "keepdims": false
          },
          "name": "global_average_pooling2d",
          "inbound_nodes": [
            [
              ["conv2d_3", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense",
          "inbound_nodes": [
            [
              ["global_average_pooling2d", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "seed": null,
            "noise_shape": null
          },
          "name": "dropout",
          "inbound_nodes": [
            [
              ["dense", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_1",
          "inbound_nodes": [
            [
              ["dropout", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "seed": null,
            "noise_shape": null
          },
          "name": "dropout_1",
          "inbound_nodes": [
            [
              ["dense_1", 0, 0, {}]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 3,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "dense_2",
          "inbound_nodes": [
            [
              ["dropout_1", 0, 0, {}]
            ]
          ]
        }
      ],
      "input_layers": [
        ["input_layer", 0, 0]
      ],
      "output_layers": [
        ["dense_2", 0, 0]
      ]
    },
    "keras_version": "2.13.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"},
        {"name": "conv2d/bias", "shape": [32], "dtype": "float32"},
        {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"},
        {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"},
        {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"},
        {"name": "conv2d_3/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"},
        {"name": "conv2d_3/bias", "shape": [256], "dtype": "float32"},
        {"name": "dense/kernel", "shape": [256, 128], "dtype": "float32"},
        {"name": "dense/bias", "shape": [128], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [128, 64], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [64, 3], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [3], "dtype": "float32"}
      ]
    }
  ]
}